# St7GetLoadPathTemplateLaneFactor

Returns the lane factor assigned to the specified load path template.

long St7GetLoadPathTemplateLaneFactor(long uID, long TemplateID, long Lane,

double* Factor)

Input Parameters

uID

Strand7 model file ID.

TemplateID

Load path template ID.

Lane

Lane number.

Load Path Templates

Output Parameters

Factor

Lane factor.